## Data Overview

I would now like to add a new column to the original dataframe of jobs in data that accounts for the different living costs depending on the employee's residence because sometimes the absolute salary doesn't tell the whole story. With that in mind i researched a new dataframe with data regarding cost of living by country and I'm going to add it to the original dataframe.

In [1]:
import pandas as pd
import numpy as np
import functions

In [2]:
cost_of_living = pd.read_csv('../data/raw/cost-of-living-by-country-2024.csv')
cost_of_living.head()

,country,NumbeoCoL2023,NumbeoCoLPlusRent2023,costOfLivingLC,costOfLivingByCountry_cl_expatistan,costOfLivingByCountry_cl_globalEcon,NumbeoLocalPurchasingPowerIndex2023
0,India,22.9,14.6,423.0,59.0,42.86,61.7
1,China,36.5,26.6,752.0,115.0,87.94,58.2
2,United States,74.2,61.0,1951.0,187.0,143.34,117.7
3,Indonesia,30.8,20.5,548.0,79.0,54.52,24.7
4,Pakistan,17.6,10.7,370.0,NaN,45.20,22.0

In [3]:
functions.nan_values(cost_of_living)

                           column_name  percentage_of_missing_values
0                              country                          0.00
1                        NumbeoCoL2023                         32.67
2                NumbeoCoLPlusRent2023                         32.67
3                       costOfLivingLC                          4.46
4  costOfLivingByCountry_cl_expatistan                         56.93
5  costOfLivingByCountry_cl_globalEcon                         17.82
6  NumbeoLocalPurchasingPowerIndex2023                         32.67

This dataframe has different factors for cost of living from different sources. I decided to go for the Global Economy factor since it's a reliable source and doesn't have so many missing values that are relevant in my original dataframe.

In [4]:
cost_of_living_sliced = cost_of_living[['country','costOfLivingByCountry_cl_globalEcon']]

In [5]:
cost_of_living_sliced.rename (columns={'costOfLivingByCountry_cl_globalEcon':'cost_of_living'}, inplace=True)

/var/folders/dx/5q4b9pnn4zl_g4hjsbv88qx00000gn/T/ipykernel_47512/2583475187.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  cost_of_living_sliced.rename (columns={'costOfLivingByCountry_cl_globalEcon':'cost_of_living'}, inplace=True)

In [6]:
cost_of_living_sliced

           country  cost_of_living
0            India           42.86
1            China           87.94
2    United States          143.34
3        Indonesia           54.52
4         Pakistan           45.20
..             ...             ...
197         Monaco             NaN
198     San Marino             NaN
199          Palau             NaN
200          Nauru             NaN
201         Tuvalu             NaN

[202 rows x 2 columns]

In [7]:
cost_of_living_sliced.to_csv('../data/cleaned/cost_of_living_cleanedV1.csv', index=False)